Revit 2027 API
MultiSegmentGrid.IsValidSketchPlaneId Method
 Identifies whether provided element id corresponds to a SketchPlane that is valid for GridChain creation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidSketchPlaneId(
	Document document,
	ElementId elemId
)
Public Shared Function IsValidSketchPlaneId (
	document As Document,
	elemId As ElementId
) As Boolean
public:
static bool IsValidSketchPlaneId(
	Document^ document,
	ElementId^ elemId
)
static member IsValidSketchPlaneId :
        document : Document *
        elemId : ElementId -> bool
Parameters
document Document
 The document.
elemId ElementId
 Element id.
Return Value
Boolean
 True if elemId is the element id of a horizontal SketchPlane.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MultiSegmentGrid Class
Autodesk.Revit.DB Namespace